<?php
    /*
     * JSON 이란
     * 학습 내용 : JSON 언어에 대해 학습합니다.
     * 힌트 내용 : JSON 은 서로 다른 언어 간에 데이터를 전달하는 역할을 합니다.
     *
     * json 은 서로 다른 프로그래밍 언어 간에 데이터를 전달하기 위해 사용하는 언어입니다.
     * form 태그에 대해 학습할 때 데이터를 입력하고 전송하면 페이지가 변환된 후 데이터를 처리했습니다.
     * 요즘은 페이지 변환 없이 페이지에서 데이터를 전송하고 처리한 결과를 받아서
     * 어떠한 행동을 하게 하는 방식을 더 많이 사용합니다.
     *
     * 자주 경험하는 예로, 회원가입 시에 아이디가 이미 존재하는지 확인하는 기능입니다.
     * 아이디 중복 버튼을 누르면 페이지가 전환되지 않고 같은 페이지에서 해당 아이디가 있는지 없는지 알려주는데,
     * 이때 전달되는 데이터가 json 으로 구성됩니다.
     *
     * 이러한 json을 다루는 방법에 대해 알아보겠습니다.
     * 본서에서 json 을 다루는 이유는 php 를 사용하여 json 데이터로 반환하여 사용하는 경우가 많기 때문입니다.
     *
     * json 데이터로 변경을 하기 전에 우선 json 에 대해 알아보겠습니다.
     * json 은 기본적으로 다음과 같은 구조를 갖습니다.
     * php 로 생각하면 $변수명 = 값과 같습니다.
     *
     * {변수명 : 값}
     *
     * 
     * */
?>