<?php
    /*
     * 자바스크립트로 JSON 데이터 다루기
     * 학습 내용 : 자바스크립트에서 json 언어를 다루는 방법에 대해 학습합니다.
     * 힌트 내용 : 자바스크립트는 서버 환경을 구축하지 않고도 사용할 수 있는 웹브라우저에서 작동하는 프로그래밍 언어입니다.
     *
     * json 은 서로 다른 프로그래밍 언어 간에 데이터를 전달하기 위한 언어입니다.
     * 본서에서 json 을 다루는 이유는 php 언어와 javascript 라는 언어 간에 데이터를 전달하기 위함입니다.
     *
     * 결론적으로 어떠한 버튼을 눌렀을 때 페이지의 변환 없이
     * 서버단(php)에서 처리한 결과를 받아서 어떠한 행동을 하는 것을 구현하기 위함입니다.
     *
     * 클라이언트 사이드에서 json 데이터를 학습 후 서버사이드에서 json 데이터를 다루는 방법을 알아보겠습니다.
     *
     * 클라이언트 사이드에서는 자바스크립트라는 언어를 사용합니다.
     * 자바스크립트는 html 태그의 head 태그 내에 script 태그를 생성하여 script 태그 내에서 사용합니다.
     * 자바스크립트에 대해서는 php와 데이터 교환을 위한 최소한의 내용만 다룹니다.
     * */
?>